# 10/05 - Pair Programming Limpieza 4 - Valores Nulos

In [1]:
import pandas as pd
import numpy as np
df = pd.read_csv("./limpio con nan.csv", index_col=0)
df.head(3)

   year        type country sex_   age     species_ fatal_(y/n)         date
0  2018     Boating     usa    F  57.0  white_shark           N  25-Jun-2018
1  2018  Unprovoked     usa    F  11.0  unspecified           N  18-Jun-2018
2  2018     Invalid     usa    M  48.0  unspecified           N  09-Jun-2018

Esto es para intentr quitar el error que nos da de limite de lectura

In [2]:
import sys 
sys.setrecursionlimit(2500)

# Ejercicio 1
Lo primero que tenemos que evaluar es en que columnas tenemos nulos y que cantidad tenemos en cada una. ¿Hay alguna columna con una gran cantidad de nulos? En caso de que sea así deberemos eliminarla.

    Que tenemos "age" los nan, los hemos dejado de limpieza 2, para poder hacer este ejercicio.

In [3]:
nulos = pd.DataFrame((df.isnull().sum() * 100) / df.shape[0]).reset_index()
nulos.columns = ["columna", "porcentaje"]
nulos

       columna  porcentaje
0         year    0.000000
1         type    0.064133
2      country    0.785634
3         sex_    9.010742
4          age   45.005612
5     species_    0.000000
6  fatal_(y/n)    8.529742
7         date    0.000000

    Las columnas con más cantidades de nulos son:
    age = 45% 
    sex_ = 9%
    fatal_(y/n) = 8%

# Ejercicio 2
Es el momento de eliminar los nulos:
Reemplazad los valores nulos de la columna age por la media de la edad, redondeada a dos decimales.

In [7]:
df.describe().round(2) # vemos los valores de la media de las dos columnas númericas

          year      age
count  6237.00  3430.00
mean   1928.87    27.33
std     276.09    13.91
min       0.00     1.00
25%    1942.00    17.00
50%    1977.00    24.00
75%    2005.00    35.00
max    2018.00    87.00

In [8]:
df_copia= df.copy() # Hacemos una copia del dataframe para hacer los cambios sobre el dataframe nuevo y no alterar el original
df_copia.head(3)

   year        type country sex_   age     species_ fatal_(y/n)         date
0  2018     Boating     usa    F  57.0  white_shark           N  25-Jun-2018
1  2018  Unprovoked     usa    F  11.0  unspecified           N  18-Jun-2018
2  2018     Invalid     usa    M  48.0  unspecified           N  09-Jun-2018

In [9]:
df_copia["age"].isnull().sum()# verificamos que tenemos 2807 nulos en la columna age

2807

In [10]:
df_copia['age'].fillna(df_copia['age'].mean ,inplace = True) #reemplazamos los nulos por la media

In [11]:
df_copia["age"].isnull().sum()# verificamos que se han reemplzado los nulos, ya no tenemos nulos en la columna age.

0

- **En relación a la columna de country al tratarse de una columna de tipo categórica, reemplazad los valores nulos por una nueva categória que se llame Unknown.**

In [15]:
df_copia.country.isnull().sum()

49

In [16]:
df_copia["country"].replace(np.nan,"Unknown",inplace=True)

In [17]:
df_copia.country.isnull().sum()

0

- **Reemplazad los valores nulos de la columna fatal por Unknown**

In [18]:
df_copia["fatal_(y/n)"].replace(np.nan,"Unknown",inplace=True)

- **Reemplazad los valores nulos de la columna type por el valor más frecuente (la moda)**

In [19]:
df_copia["type"].mode()[0]

'Unprovoked'

In [20]:
df_copia["type"].replace(np.nan, df_copia["type"].mode()[0] , inplace = True)

In [21]:
df_copia["type"].isnull().sum()

0

- **Reemplazad los valores nulos de la columna fecha por Unknown**

In [22]:
df_copia["date"].replace(np.nan,"Unknown",inplace=True)

In [23]:
df_copia["date"].isnull().sum()

0

# Ejercicio 3 
Guardad el csv para seguir trabajando con el en los siguientes ejercicios de pair

In [ ]:
df_copia.to_csv("Limpieza_4.csv") #Debido al error Recurso error no se puede guardar el csv